#include <stdio.h>
#include <math.h>

#define N 1000000               // начальный капитал
#define D 150000                // доход в мес.
#define Y 20                    // кол-во лет

int main() {                    // ***** - ПЕРЕДЕЛЫВАЙ! (см. циклы подсчета дохода)

    int i;

    double A, A0 = N, A1, A_kv = 40000;                 // Alice: капитал, капитал + ЗП - (аренда + ЖКХ), кап-ция вклада, (аренда + ЖКХ)
    double B, B0 = N, B1, B_kv = 10000;                 // Bob: капитал, капитал + ЗП - ЖКХ, кап-ция вклада, ЖКХ
    double B_pl, B_perv = 300000;                       // Bob: ежегод. аннуитентный платеж (Вики), перв. взнос
    double p_vk = 8, p_ip = 12, S = 3000000;            // % по вкладу, % по ипотеке, стоимость квартиры


    printf("\nAlice\n\n");
    for (i = 1; i < Y + 1; i++){
        A0 = A0 + (12 * D) - (12 * A_kv);               // нач. кап. + 12 мес. ЗП - 12 мес. (аренда + ЖКХ)
        A1 = p_vk/100 * A0;                             // кап-ция вклада в конце года
        A = A0 + A1;
        printf("%d   %lf   %lf   %lf\n", i, A0, A1, A);
    }
    printf("\nAlice's capital = %lf\n\n", A - S);


    B_pl = S * (p_ip / 100) / (1 - pow(1 + p_ip/100, -Y ));        // Bob: ежегод. аннуитентный платеж (Вики)
//    printf("\n%lf\n\n", B_pl);
    B0 = B0 - B_perv;                                                    // нач. кап. - перв. взнос

    printf("\nBob\n\n");
    for (i = 1; i < Y + 1; i++){
        B0 = B0 + (12 * D) - (12 * B_kv) - B_pl;      // нач. кап. + 12 мес. ЗП - 12 мес. ЖКХ - ежегод. пл.
        B1 = p_vk/100 * B0;                                   // кап-ция вклада в конце года
        B = B0 + B1;
        printf("%d   %lf   %lf   %lf\n", i, B0, B1, B);
    }
    printf("\nBob's capital = %lf\n\n", B);

    return 0;
}